[
    { 
        "title": "Mediterranean Grilled Vegetables",
        "content": "Grill a variety of vegetables such as zucchini, bell peppers, eggplant, and cherry tomatoes. Drizzle with olive oil, lemon juice, and sprinkle with fresh herbs like oregano and thyme."
    },
    { 
        "title": "Quinoa Stuffed Bell Peppers",
        "content": "Cook quinoa according to package instructions. Mix with black beans, corn, diced tomatoes, and spices. Stuff the mixture into halved bell peppers and bake until tender."
    },
    { 
        "title": "Green Smoothie Bowl",
        "content": "Blend spinach, kale, banana, pineapple, and coconut water until smooth. Pour into a bowl and top with sliced fruits, nuts, and seeds for added texture and nutrients."
    },
    { 
        "title": "Vegetable Curry with Chickpeas",
        "content": "Sauté onions, garlic, and ginger in a pot. Add curry powder, turmeric, and cumin. Stir in chopped vegetables, chickpeas, and coconut milk. Simmer until vegetables are tender. Serve over rice."
    },
    { 
        "title": "Mango Avocado Salad",
        "content": "Combine diced mango, avocado, cucumber, red onion, and cilantro in a bowl. Dress with lime juice, olive oil, salt, and pepper. Toss gently and serve as a refreshing side dish."
    },
    { 
        "title": "Tofu Stir-Fry",
        "content": "Marinate tofu in soy sauce, sesame oil, and garlic. Stir-fry with colorful vegetables like bell peppers, broccoli, and snap peas. Serve over brown rice or noodles."
    },
    { 
        "title": "Vegetarian Chili",
        "content": "Sauté onions, garlic, and bell peppers in a pot. Add kidney beans, black beans, diced tomatoes, vegetable broth, and chili powder. Simmer until flavors meld. Serve with toppings like avocado and cilantro."
    },
    { 
        "title": "Spinach and Mushroom Quesadillas",
        "content": "Sauté sliced mushrooms and spinach until wilted. Place on a tortilla with shredded cheese. Fold in half and cook in a skillet until golden and crispy. Serve with salsa and guacamole."
    },
    { 
        "title": "Falafel Wrap",
        "content": "Stuff whole-wheat wraps with homemade or store-bought falafel balls, sliced cucumbers, tomatoes, lettuce, and tahini sauce. Roll up and enjoy a delicious and filling wrap."
    },
    { 
        "title": "Ratatouille",
        "content": "Layer thinly sliced vegetables like tomatoes, zucchini, eggplant, and bell peppers in a baking dish. Drizzle with olive oil, sprinkle with herbs, and bake until vegetables are tender and slightly caramelized."
    }
]
